Revit 2027 API
AssetPropertyDoubleArray3d.GetValueAsXYZ Method
 Get the value property as a vector or point XYZ.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetValueAsXYZ()
Public Function GetValueAsXYZ As XYZ
public:
XYZ^ GetValueAsXYZ()
member GetValueAsXYZ : unit -> XYZ
Return Value
XYZ
See Also
Reference
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace